-- Добавление задачи 1
INSERT INTO Tasks (title, description, initialCode)
VALUES ('Сумма двух чисел', 'Напишите программу, которая принимает два числа от пользователя и выводит их сумму.', NULL);

-- Добавление задачи 2
INSERT INTO Tasks (title, description, initialCode)
VALUES ('Проверка на четность', 'Напишите программу, которая проверяет, является ли введенное пользователем число четным или нечетным.', NULL);

-- Добавление задачи 3
INSERT INTO Tasks (title, description, initialCode)
VALUES ('Калькулятор с четырьмя основными операциями', 'Создайте программу-калькулятор, которая принимает два числа и оператор (+, -, *, /) от пользователя и выводит результат.', NULL);

-- Добавление задачи 4
INSERT INTO Tasks (title, description, initialCode)
VALUES ('Поиск максимального числа в массиве', 'Напишите программу, которая находит и выводит наибольшее число из массива целых чисел.', NULL);

-- Добавление задачи 5
INSERT INTO Tasks (title, description, initialCode)
VALUES ('Факториал числа', 'Напишите программу, которая вычисляет факториал введенного пользователем числа.', NULL);

-- Добавление задачи 6
INSERT INTO Tasks (title, description, initialCode)
VALUES ('Проверка на простое число', 'Напишите программу, которая определяет, является ли введенное пользователем число простым.', NULL);

-- Добавление задачи 7
INSERT INTO Tasks (title, description, initialCode)
VALUES ('Перевод температуры', 'Напишите программу для перевода температуры из градусов Цельсия в градусы Фаренгейта и наоборот.', NULL);

-- Добавление задачи 8
INSERT INTO Tasks (title, description, initialCode)
VALUES ('Проверка на палиндром', 'Напишите программу, которая определяет, является ли введенная пользователем строка палиндромом.', NULL);

-- Добавление задачи 9
INSERT INTO Tasks (title, description, initialCode)
VALUES ('Генератор случайного пароля', 'Создайте программу, которая генерирует случайный пароль заданной длины и состоящий из цифр, букв верхнего и нижнего регистра.', NULL);

-- Добавление задачи 10
INSERT INTO Tasks (title, description, initialCode)
VALUES ('Программа для подсчета количества слов в предложении', 'Напишите программу, которая принимает предложение от пользователя и выводит количество слов в нем.', NULL);
